import { Link } from 'react-router-dom';

function PrivacyPolicy() {
  return (
    <div>
      <div className='body-info'>
        <h1 className='h1-title'> מדיניות פרטיות</h1>
        <div className='flex-container-info'>
          <br/>
          <section className='section-privacy'>
            <p>
            תודה שבחרת להשתמש באתר להזמנת מקום ללינה
             באתרי הקמפינג של רשות הטבע והגנים. אנו מקנים חשיבות רבה לפרטיותך ונוקטים
             בכל הצעדים הנדרשים כדי להגן על המידע האישי שלך. במדיניות פרטיות זו,
             נסביר את סוגי המידע שאנו אוספים, את שימושנו בו ואת האמצעים 
            שאנו משתמשים בהם כדי להגן על המידע שלך.
            אנא קרא בקפידה את המדיניות הבאה:
            </p>

            <h4> איסוף מידע אישי </h4>
            <p>
            כאשר אתה מבצע הזמנה למקום באחד מאתרי הקמפינג שלנו,
             אנו מבקשים ממך לספק מספר פרטים אישיים כגון שם, כתובת דוא"ל,
             מספר טלפון ומידע אחר שיכול להיות חשוב עבור ההזמנה. אנו משתמשים במידע
             זה רק לצורך מילוי וניהול ההזמנה שלך ולתקשורת איתך בנוגע להזמנה.
            </p>

            <h4> שימוש במידע אישי</h4>
            <p>
            אנו משתמשים במידע האישי שלך רק למטרות שירות, תקשורת
             וניהול ההזמנה שלך. אנו לא משתפים את המידע שלך עם צדדים שלישיים מלבד
             במקרים בהם יש לנו את הסכמתך המפורשת או כאשר השיתוף הוא חובה על פי דין.
            </p>

            <h4> אבטחת מידע </h4>
            <p>
            אנו מבצעים כל האמצעים הנדרשים כדי לשמור על המידע האישי שלך
             ולמנוע גישה לא מורשית או שימוש לרעה. אנו משתמשים בטכנולוגיות
             אבטחה מתקדמות ומחייבות כדי לשמור על פרטיות המידע ולמנוע איבוד,
             נזק או שינוי לא מורשה של המידע שאנו אוספים.
            </p>

            <h4> קישורים לאתרים חיצוניים </h4>
            <p>
            האתר שלנו עשוי להכיל קישורים לאתרים חיצוניים שאינם בבעלותנו או בשליטתנו.
             אנא שים לב שאנחנו לא אחראים למדיניות הפרטיות של אתרים אלו.
             אנו ממליצים לך לקרוא את מדיניות הפרטיות של כל אתר שאתה מבקר בו.
            </p>

            <h4> תקופת שמירת המידע </h4>
            <p>
            אנו שומרים על מידע המשתמש שלך רק כל עוד זה נדרש למטרות
             הגבלים משפטיות או עסקיות. אנו מתחייבים למחוק את המידע האישי שלך
             כאשר הוא אינו נדרש עוד למטרות הגבלים חוקיות או לצורך שירות עתידי.
            </p>

            <h4> שינויים במדיניות הפרטיות</h4>
            <p>
            נשמור על זכותנו לשנות את מדיניות
             הפרטיות הזו בכול עת. אנחנו ממליצים לך לבדוק מדי פעם את מדיניות
             הפרטיות הנוכחית בכדי להיות מעודכן לגבי שינויים שעשויים להתרחש.
            </p>
            <br/>
            <p>
            אם יש לך שאלות נוספות או דאגות בנושא הפרטיות,
             אנא צור קשר עמנו. אנחנו תמיד כאן כדי לעזור לך. <br/>
            תודה על שימושך באתר שלנו ומצפים לספק
            לך שירות מעולה וחוויה נהדרת באתרי הקמפינג של רשות הטבע והגנים.
            </p>

          </section>

          <Link to="/" className="primary-button button-hover-white">
            <b> חזרה לדף הראשי</b>
          </Link>
        </div>
      </div>
    </div>
  );
}

export default PrivacyPolicy;
