import { Link } from 'react-router-dom';

function TermsUse() {
  return (
    <div>
      <div className='body-info'>
        <h1 className='h1-title'> תנאי שימוש </h1>
        <div className='flex-container-info'>
          <br/>
          <section className='section-privacy'>
            <p>
            ברוכים הבאים לאתר להזמנת מקום ללינה באתרי הקמפינג של רשות הטבע והגנים.
             אנא קרא בקפידה את תנאי השימוש הבאים:
            </p>

            <h4> הסכמה לתנאים </h4>
            <p>
            בעת השימוש באתר ובביצוע ההזמנה, אתה מסכים לכל תנאי השימוש המפורטים
             במסמך זה. אם אתה אינך מסכים עם התנאים, אנא אל תשתמש באתר ואל תבצע הזמנות.
            </p>

            <h4> השימוש באתר </h4>
            <p>
            אתה מסכים להשתמש באתר רק למטרות הולמות ובהתאם לחוקים
             ותקנות החלים במדינתך. אתה אחראי לכל הפעילות שמתבצעת דרך האתר בשמך.
            </p>

            <h4> מידע אישי </h4>
            <p>
            בעת ביצוע הזמנה, עליך לספק מידע אישי כמו שם,
             כתובת דוא"ל, טלפון ומידע נוסף שיהיה דרוש לטובת ההזמנה.
             אתה מאשר שהמידע שסיפקת נכון, מדויק ומעודכן.
            </p>

            <h4> הזמנות </h4>
            <p>
            הזמנת מקום ללינה מתבצעת באמצעות האתר.
             אנו שומרים לעצמנו את הזכות לקבוע תנאים נוספים להזמנה
             כגון זמן הגעה וסיום השהות, מגבלות גיל, תנאי תשלום ותנאים נוספים.
             אנו עשויים לדרוש תשלום מראש כחלק מתהליך ההזמנה.
            </p>

            <h4> ביטולים ושינויים </h4>
            <p>
            ביטולים או שינויים בהזמנה יעשו על פי הנהלים והתנאים שיקבעו על ידינו.
             אנו עשויים לקבוע תנאי ביטול, דמי ביטול ותנאים נוספים.
             ניתן לקבל מידע נוסף בנושא ממחלקת השירות שלנו.
            </p>

            <h4> אחריות </h4>
            <p>
            אנו שומרים לעצמנו את הזכות לשנות את תנאי
             השימוש האלו בכל עת ולפי שיקול דעתנו הבלעדי. אנו לא אחראים לכל
             נזק שיגרם על ידי שימוש לא תקין, נושא או מידע שגוי המתפרסם באתר.
            </p>

            <h4> זכויות יוצרים </h4>
            <p>
            כל הזכויות היוצרים והמוגנות הן של דביר קרל, לי שמואלי כהן ואלינה ויסוצקי.
             אין להשתמש בתוכן האתר ללא רשות מפורשת.
            </p>

          </section>

          <Link to="/" className="primary-button button-hover-white">
            <b> חזרה לדף הראשי</b>
          </Link>
        </div>
      </div>
    </div>
  );
}

export default TermsUse;
